import json

from solve_task import solve_task

tasks = [
    {
        'task_num': 1,
        'condition': (
            'В остроугольном треугольнике ABC высоты AA1 и CC1 '
            'пересекаются в точке H. Радиус описанной около '
            'треугольника ABC окружности равен 10. Расстояние '
            'от центра описанной окружности до стороны AC равно 6. '
            'Найдите длину отрезка BH.'
        ),
    },
    {
        'task_num': 2,
        'condition': (
            'В конус вписан шар. Отношение высоты конуса к радиусу '
            'его основания равно 4:3, а объем конуса равен 27. '
            'Найдите объем вписанного шара.'
        ),
    },
    {
        'task_num': 3,
        'condition': (
            'Два теннисиста играют матч до трёх побед в сетах. '
            'Матч заканчивается, как только один из них выигрывает '
            '3 сета. Вероятность того, что первый игрок выиграет '
            'любой отдельно взятый сет, равна 0,6. Найдите '
            'вероятность того, что для выявления победителя '
            'в матче потребуется сыграть ровно 4 сета.'
        ),
    },
    {
        'task_num': 4,
        'condition': (
            'На заводе производят процессоры. Каждый чип проходит '
            'два независимых теста качества на разных конвейерах. '
            'Если чип исправен, он проходит первый тест с '
            'вероятностью 0,95, а второй — с вероятностью 0,98. '
            'Если чип бракованный, он ошибочно проходит первый '
            'тест с вероятностью 0,1, а второй — с вероятностью '
            '0,05. Известно, что 4% выпускаемых чипов изначально '
            'имеют скрытый брак. Чип отправляется в продажу, только '
            'если успешно прошёл хотя бы один из двух тестов. '
            'Из партии готовой продукции случайно берут один чип. '
            'Какова вероятность того, что он окажется исправным? '
            'Ответ округлите до десятитысячных.'
        ),
    },
]


def main():
    results = []
    for task in tasks:
        print(f'\nРешаем задание {task["task_num"]}...')
        result = solve_task(
            task_num=task['task_num'],
            condition=task['condition'],
        )

        results.append(result)
        print(json.dumps(result, ensure_ascii=False, indent=2,))

    output_path = 'data/raw/solved_tasks.json'
    with open(output_path, 'w', encoding='utf-8') as file:
        json.dump(results, file, ensure_ascii=False, indent=2,)
    print(f'\nРезультаты сохранены в {output_path}')


if __name__ == '__main__':
    main()
